fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Область ОбработчикиСобытий
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаПроведения(Отказ,Режим)
	
	//Движения по регистру ВКМ_ВыполненныеКлиентуРаботы
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_НачалоДействияДоговора КАК НачалоДействияДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_КонецДействияДоговора КАК КонецДействияДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|	И
		|		ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка.Вид указанного договора, не является видом договора""Абонентское обслуживание"".",,,,Отказ);
	КонецЕсли;
	Если РезультатЗапроса.Пустой() = Ложь И (Дата < Выборка.НачалоДействияДоговора ИЛИ Дата > Выборка.КонецДействияДоговора) Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка.Дата документа не находится в периоде действия данного Договора на абонентское обслуживание",,,,Отказ);
	КонецЕсли;
	
	
	Если Не РезультатЗапроса.Пустой() Тогда
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = ТекСтрокаВыполненныеРаботы.ФактическиПотраченоЧасов * Выборка.СтоимостьЧасаРаботы;
	КонецЦикла;
	КонецЕсли;
	
	//Движения по регистру ВКМ_ВыполненныеСотрудникомРаботы
	
	ПроцентОтРабот = ВКМ_ПроцентОтРаботыДляСотрудникаВызовСервера.ПроцентОтРаботыДляСотрудника(Специалист,Дата);
	
	Если ПроцентОтРабот = Неопределено Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Для выбранного специалиста не установлен процент от выполненных заказов.",,,,Отказ);
	
	Иначе
    Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ТекСтрокаВыполненныеРаботы.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту * Выборка.СтоимостьЧасаРаботы * ПроцентОтРабот / 100;
	КонецЦикла;
	
     Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
    КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда  
	Возврат; 
	КонецЕсли;  
	
	Если Не Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот КАК ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
		|	ВКМ_ОбслуживаниеКлиента.Номер,
		|	ВКМ_ОбслуживаниеКлиента.Дата
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		СпециалистЗамена = "";
		ДатаПроведенияРаботЗамена = "";
		ВремяНачалаРаботЗамена = "";
		ВремяОкончанияРаботЗамена = "";
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.Специалист <> Специалист Тогда
				СпециалистЗамена = СтрШаблон("В заявке на обслуживание  № %2 от %3 поменялся специалист.Новый специалист - %1",Специалист,Выборка.Номер,Выборка.Дата); 
			КонецЕсли;	
			Если Выборка.ДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
				ДатаПроведенияРаботЗамена = СтрШаблон("В заявке на обслуживание  № %2 от %3 поменялась дата проведения работ.Новая дата проведения работ - %1",Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy;"),Выборка.Номер,Выборка.Дата); 
			КонецЕсли;	
			Если Выборка.ВремяНачалаРабот <> ВремяНачалаРабот Тогда
				ВремяНачалаРаботЗамена = СтрШаблон("В заявке на обслуживание  № %2 от %3 поменялось время начала работ.Новое время начала работ - %1",Формат(ВремяНачалаРабот,"ДЛФ=T"),Выборка.Номер,Выборка.Дата);
			КонецЕсли;			
			Если Выборка.ВремяОкончанияРабот <> ВремяОкончанияРабот Тогда
				ВремяОкончанияРаботЗамена = СтрШаблон("В заявке на обслуживание  № %2 от %3 поменялось время окончания работ.Новое время окончания работ - %1",Формат(ВремяОкончанияРабот,"ДЛФ=T"),Выборка.Номер,Выборка.Дата);
			КонецЕсли;				
		КонецЦикла; 
		
		
		 Сообщение = СпециалистЗамена + ДатаПроведенияРаботЗамена + ВремяНачалаРаботЗамена + ВремяОкончанияРаботЗамена; 
		 
		 Если Сообщение <> "" Тогда
		 НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		 НовыйЭлемент.ТекстСообщения = Сообщение;
		 НовыйЭлемент.Записать();

		 КонецЕСли;
		
	КонецЕсли;
	
	// Если документ записывается в первый разв базу	
	
	Если Ссылка.Пустая() Тогда  
		
		 СОобщение = СтрШаблон("Новая заявка на обслуживание от %7 Клиент - %1.Специалист - %2. Дата проведения работ - %3.Время начала работ - %4.Время окончания работ - %5. Описание проблемы - %6",Клиент,Специалист,Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy;"),Формат(ВремяНачалаРабот,"ДЛФ=T"),Формат(ВремяОкончанияРабот,"ДЛФ=T"),ОписаниеПроблемы,Дата);  
		
		 НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		 НовыйЭлемент.ТекстСообщения = Сообщение;
		 НовыйЭлемент.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
